dvdfreitag/ocarina/CMSIS/devices/same70q21/include/component/afec.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AFEC_IDR_OFFSET                     (0x28)                                        /**<  (AFEC_IDR) AFEC Interrupt Disable Register  Offset */

#define AFEC_IDR_EOC0_Pos                   0                                              /**< (AFEC_IDR) End of Conversion Interrupt Disable 0 Position */
#define AFEC_IDR_EOC0_Msk                   (_U_(0x1) << AFEC_IDR_EOC0_Pos)                /**< (AFEC_IDR) End of Conversion Interrupt Disable 0 Mask */
#define AFEC_IDR_EOC0                       AFEC_IDR_EOC0_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_IDR_EOC0_Msk instead */
#define AFEC_IDR_EOC1_Pos                   1                                              /**< (AFEC_IDR) End of Conversion Interrupt Disable 1 Position */
#define AFEC_IDR_EOC1_Msk                   (_U_(0x1) << AFEC_IDR_EOC1_Pos)                /**< (AFEC_IDR) End of Conversion Interrupt Disable 1 Mask */
#define AFEC_IDR_EOC1                       AFEC_IDR_EOC1_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_IDR_EOC1_Msk instead */
#define AFEC_IDR_EOC2_Pos                   2                                              /**< (AFEC_IDR) End of Conversion Interrupt Disable 2 Position */
#define AFEC_IDR_EOC2_Msk                   (_U_(0x1) << AFEC_IDR_EOC2_Pos)                /**< (AFEC_IDR) End of Conversion Interrupt Disable 2 Mask */
#define AFEC_IDR_EOC2                       AFEC_IDR_EOC2_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_IDR_EOC2_Msk instead */
#define AFEC_IDR_EOC3_Pos                   3                                              /**< (AFEC_IDR) End of Conversion Interrupt Disable 3 Position */
#define AFEC_IDR_EOC3_Msk                   (_U_(0x1) << AFEC_IDR_EOC3_Pos)                /**< (AFEC_IDR) End of Conversion Interrupt Disable 3 Mask */
#define AFEC_IDR_EOC3                       AFEC_IDR_EOC3_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_IDR_EOC3_Msk instead */
#define AFEC_IDR_EOC4_Pos                   4                                              /**< (AFEC_IDR) End of Conversion Interrupt Disable 4 Position */
#define AFEC_IDR_EOC4_Msk                   (_U_(0x1) << AFEC_IDR_EOC4_Pos)                /**< (AFEC_IDR) End of Conversion Interrupt Disable 4 Mask */
#define AFEC_IDR_EOC4                       AFEC_IDR_EOC4_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_IDR_EOC4_Msk instead */
#define AFEC_IDR_EOC5_Pos                   5                                              /**< (AFEC_IDR) End of Conversion Interrupt Disable 5 Position */
#define AFEC_IDR_EOC5_Msk                   (_U_(0x1) << AFEC_IDR_EOC5_Pos)                /**< (AFEC_IDR) End of Conversion Interrupt Disable 5 Mask */
#define AFEC_IDR_EOC5                       AFEC_IDR_EOC5_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_IDR_EOC5_Msk instead */
#define AFEC_IDR_EOC6_Pos                   6                                              /**< (AFEC_IDR) End of Conversion Interrupt Disable 6 Position */
#define AFEC_IDR_EOC6_Msk                   (_U_(0x1) << AFEC_IDR_EOC6_Pos)                /**< (AFEC_IDR) End of Conversion Interrupt Disable 6 Mask */
#define AFEC_IDR_EOC6                       AFEC_IDR_EOC6_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_IDR_EOC6_Msk instead */
#define AFEC_IDR_EOC7_Pos                   7                                              /**< (AFEC_IDR) End of Conversion Interrupt Disable 7 Position */
#define AFEC_IDR_EOC7_Msk                   (_U_(0x1) << AFEC_IDR_EOC7_Pos)                /**< (AFEC_IDR) End of Conversion Interrupt Disable 7 Mask */
#define AFEC_IDR_EOC7                       AFEC_IDR_EOC7_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_IDR_EOC7_Msk instead */
#define AFEC_IDR_EOC8_Pos                   8                                              /**< (AFEC_IDR) End of Conversion Interrupt Disable 8 Position */
#define AFEC_IDR_EOC8_Msk                   (_U_(0x1) << AFEC_IDR_EOC8_Pos)                /**< (AFEC_IDR) End of Conversion Interrupt Disable 8 Mask */
#define AFEC_IDR_EOC8                       AFEC_IDR_EOC8_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_IDR_EOC8_Msk instead */
#define AFEC_IDR_EOC9_Pos                   9                                              /**< (AFEC_IDR) End of Conversion Interrupt Disable 9 Position */
#define AFEC_IDR_EOC9_Msk                   (_U_(0x1) << AFEC_IDR_EOC9_Pos)                /**< (AFEC_IDR) End of Conversion Interrupt Disable 9 Mask */
#define AFEC_IDR_EOC9                       AFEC_IDR_EOC9_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_IDR_EOC9_Msk instead */
#define AFEC_IDR_EOC10_Pos                  10                                             /**< (AFEC_IDR) End of Conversion Interrupt Disable 10 Position */
#define AFEC_IDR_EOC10_Msk                  (_U_(0x1) << AFEC_IDR_EOC10_Pos)               /**< (AFEC_IDR) End of Conversion Interrupt Disable 10 Mask */
#define AFEC_IDR_EOC10                      AFEC_IDR_EOC10_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_IDR_EOC10_Msk instead */
#define AFEC_IDR_EOC11_Pos                  11                                             /**< (AFEC_IDR) End of Conversion Interrupt Disable 11 Position */
#define AFEC_IDR_EOC11_Msk                  (_U_(0x1) << AFEC_IDR_EOC11_Pos)               /**< (AFEC_IDR) End of Conversion Interrupt Disable 11 Mask */
#define AFEC_IDR_EOC11                      AFEC_IDR_EOC11_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_IDR_EOC11_Msk instead */
#define AFEC_IDR_DRDY_Pos                   24                                             /**< (AFEC_IDR) Data Ready Interrupt Disable Position */
#define AFEC_IDR_DRDY_Msk                   (_U_(0x1) << AFEC_IDR_DRDY_Pos)                /**< (AFEC_IDR) Data Ready Interrupt Disable Mask */
#define AFEC_IDR_DRDY                       AFEC_IDR_DRDY_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_IDR_DRDY_Msk instead */
#define AFEC_IDR_GOVRE_Pos                  25                                             /**< (AFEC_IDR) General Overrun Error Interrupt Disable Position */
#define AFEC_IDR_GOVRE_Msk                  (_U_(0x1) << AFEC_IDR_GOVRE_Pos)               /**< (AFEC_IDR) General Overrun Error Interrupt Disable Mask */
#define AFEC_IDR_GOVRE                      AFEC_IDR_GOVRE_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_IDR_GOVRE_Msk instead */
#define AFEC_IDR_COMPE_Pos                  26                                             /**< (AFEC_IDR) Comparison Event Interrupt Disable Position */
#define AFEC_IDR_COMPE_Msk                  (_U_(0x1) << AFEC_IDR_COMPE_Pos)               /**< (AFEC_IDR) Comparison Event Interrupt Disable Mask */
#define AFEC_IDR_COMPE                      AFEC_IDR_COMPE_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_IDR_COMPE_Msk instead */
#define AFEC_IDR_TEMPCHG_Pos                30                                             /**< (AFEC_IDR) Temperature Change Interrupt Disable Position */
#define AFEC_IDR_TEMPCHG_Msk                (_U_(0x1) << AFEC_IDR_TEMPCHG_Pos)             /**< (AFEC_IDR) Temperature Change Interrupt Disable Mask */
#define AFEC_IDR_TEMPCHG                    AFEC_IDR_TEMPCHG_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_IDR_TEMPCHG_Msk instead */
#define AFEC_IDR_MASK                       _U_(0x47000FFF)                                /**< \deprecated (AFEC_IDR) Register MASK  (Use AFEC_IDR_Msk instead)  */
#define AFEC_IDR_Msk                        _U_(0x47000FFF)                                /**< (AFEC_IDR) Register Mask  */

#define AFEC_IDR_EOC_Pos                    0                                              /**< (AFEC_IDR Position) End of Conversion Interrupt Disable x */
#define AFEC_IDR_EOC_Msk                    (_U_(0xFFF) << AFEC_IDR_EOC_Pos)               /**< (AFEC_IDR Mask) EOC */
#define AFEC_IDR_EOC(value)                 (AFEC_IDR_EOC_Msk & ((value) << AFEC_IDR_EOC_Pos))  

