dvdfreitag/ocarina/CMSIS/devices/same70q21/include/component/afec.h
/* -------- AFEC_COSR : (AFEC Offset: 0xd0) (R/W 32) AFEC Correction Select Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CSEL:1;                    /**< bit:      0  Sample & Hold unit Correction Select     */
    uint32_t :31;                       /**< bit:  1..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} AFEC_COSR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AFEC_COSR_OFFSET                    (0xD0)                                        /**<  (AFEC_COSR) AFEC Correction Select Register  Offset */

#define AFEC_COSR_CSEL_Pos                  0                                              /**< (AFEC_COSR) Sample & Hold unit Correction Select Position */
#define AFEC_COSR_CSEL_Msk                  (_U_(0x1) << AFEC_COSR_CSEL_Pos)               /**< (AFEC_COSR) Sample & Hold unit Correction Select Mask */
#define AFEC_COSR_CSEL                      AFEC_COSR_CSEL_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_COSR_CSEL_Msk instead */
#define AFEC_COSR_MASK                      _U_(0x01)                                      /**< \deprecated (AFEC_COSR) Register MASK  (Use AFEC_COSR_Msk instead)  */
#define AFEC_COSR_Msk                       _U_(0x01)                                      /**< (AFEC_COSR) Register Mask  */


/* -------- AFEC_CVR : (AFEC Offset: 0xd4) (R/W 32) AFEC Correction Values Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t OFFSETCORR:16;             /**< bit:  0..15  Offset Correction                        */
    uint32_t GAINCORR:16;               /**< bit: 16..31  Gain Correction                          */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} AFEC_CVR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AFEC_CVR_OFFSET                     (0xD4)                                        /**<  (AFEC_CVR) AFEC Correction Values Register  Offset */

#define AFEC_CVR_OFFSETCORR_Pos             0                                              /**< (AFEC_CVR) Offset Correction Position */
#define AFEC_CVR_OFFSETCORR_Msk             (_U_(0xFFFF) << AFEC_CVR_OFFSETCORR_Pos)       /**< (AFEC_CVR) Offset Correction Mask */
#define AFEC_CVR_OFFSETCORR(value)          (AFEC_CVR_OFFSETCORR_Msk & ((value) << AFEC_CVR_OFFSETCORR_Pos))
#define AFEC_CVR_GAINCORR_Pos               16                                             /**< (AFEC_CVR) Gain Correction Position */
#define AFEC_CVR_GAINCORR_Msk               (_U_(0xFFFF) << AFEC_CVR_GAINCORR_Pos)         /**< (AFEC_CVR) Gain Correction Mask */
#define AFEC_CVR_GAINCORR(value)            (AFEC_CVR_GAINCORR_Msk & ((value) << AFEC_CVR_GAINCORR_Pos))
#define AFEC_CVR_MASK                       _U_(0xFFFFFFFF)                                /**< \deprecated (AFEC_CVR) Register MASK  (Use AFEC_CVR_Msk instead)  */
#define AFEC_CVR_Msk                        _U_(0xFFFFFFFF)                                /**< (AFEC_CVR) Register Mask  */


/* -------- AFEC_CECR : (AFEC Offset: 0xd8) (R/W 32) AFEC Channel Error Correction Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t ECORR0:1;                  /**< bit:      0  Error Correction Enable for channel 0    */
    uint32_t ECORR1:1;                  /**< bit:      1  Error Correction Enable for channel 1    */
    uint32_t ECORR2:1;                  /**< bit:      2  Error Correction Enable for channel 2    */
    uint32_t ECORR3:1;                  /**< bit:      3  Error Correction Enable for channel 3    */
    uint32_t ECORR4:1;                  /**< bit:      4  Error Correction Enable for channel 4    */
    uint32_t ECORR5:1;                  /**< bit:      5  Error Correction Enable for channel 5    */
    uint32_t ECORR6:1;                  /**< bit:      6  Error Correction Enable for channel 6    */
    uint32_t ECORR7:1;                  /**< bit:      7  Error Correction Enable for channel 7    */
    uint32_t ECORR8:1;                  /**< bit:      8  Error Correction Enable for channel 8    */
    uint32_t ECORR9:1;                  /**< bit:      9  Error Correction Enable for channel 9    */
    uint32_t ECORR10:1;                 /**< bit:     10  Error Correction Enable for channel 10   */
    uint32_t ECORR11:1;                 /**< bit:     11  Error Correction Enable for channel 11   */
    uint32_t :20;                       /**< bit: 12..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t ECORR:12;                  /**< bit:  0..11  Error Correction Enable for channel xx   */
    uint32_t :20;                       /**< bit: 12..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} AFEC_CECR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AFEC_CECR_OFFSET                    (0xD8)                                        /**<  (AFEC_CECR) AFEC Channel Error Correction Register  Offset */

#define AFEC_CECR_ECORR0_Pos                0                                              /**< (AFEC_CECR) Error Correction Enable for channel 0 Position */
#define AFEC_CECR_ECORR0_Msk                (_U_(0x1) << AFEC_CECR_ECORR0_Pos)             /**< (AFEC_CECR) Error Correction Enable for channel 0 Mask */
#define AFEC_CECR_ECORR0                    AFEC_CECR_ECORR0_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CECR_ECORR0_Msk instead */
#define AFEC_CECR_ECORR1_Pos                1                                              /**< (AFEC_CECR) Error Correction Enable for channel 1 Position */
#define AFEC_CECR_ECORR1_Msk                (_U_(0x1) << AFEC_CECR_ECORR1_Pos)             /**< (AFEC_CECR) Error Correction Enable for channel 1 Mask */
#define AFEC_CECR_ECORR1                    AFEC_CECR_ECORR1_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CECR_ECORR1_Msk instead */
#define AFEC_CECR_ECORR2_Pos                2                                              /**< (AFEC_CECR) Error Correction Enable for channel 2 Position */
#define AFEC_CECR_ECORR2_Msk                (_U_(0x1) << AFEC_CECR_ECORR2_Pos)             /**< (AFEC_CECR) Error Correction Enable for channel 2 Mask */
#define AFEC_CECR_ECORR2                    AFEC_CECR_ECORR2_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CECR_ECORR2_Msk instead */
#define AFEC_CECR_ECORR3_Pos                3                                              /**< (AFEC_CECR) Error Correction Enable for channel 3 Position */
#define AFEC_CECR_ECORR3_Msk                (_U_(0x1) << AFEC_CECR_ECORR3_Pos)             /**< (AFEC_CECR) Error Correction Enable for channel 3 Mask */
#define AFEC_CECR_ECORR3                    AFEC_CECR_ECORR3_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CECR_ECORR3_Msk instead */
#define AFEC_CECR_ECORR4_Pos                4                                              /**< (AFEC_CECR) Error Correction Enable for channel 4 Position */
#define AFEC_CECR_ECORR4_Msk                (_U_(0x1) << AFEC_CECR_ECORR4_Pos)             /**< (AFEC_CECR) Error Correction Enable for channel 4 Mask */
#define AFEC_CECR_ECORR4                    AFEC_CECR_ECORR4_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CECR_ECORR4_Msk instead */
#define AFEC_CECR_ECORR5_Pos                5                                              /**< (AFEC_CECR) Error Correction Enable for channel 5 Position */
#define AFEC_CECR_ECORR5_Msk                (_U_(0x1) << AFEC_CECR_ECORR5_Pos)             /**< (AFEC_CECR) Error Correction Enable for channel 5 Mask */
#define AFEC_CECR_ECORR5                    AFEC_CECR_ECORR5_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CECR_ECORR5_Msk instead */
#define AFEC_CECR_ECORR6_Pos                6                                              /**< (AFEC_CECR) Error Correction Enable for channel 6 Position */
#define AFEC_CECR_ECORR6_Msk                (_U_(0x1) << AFEC_CECR_ECORR6_Pos)             /**< (AFEC_CECR) Error Correction Enable for channel 6 Mask */
#define AFEC_CECR_ECORR6                    AFEC_CECR_ECORR6_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CECR_ECORR6_Msk instead */
#define AFEC_CECR_ECORR7_Pos                7                                              /**< (AFEC_CECR) Error Correction Enable for channel 7 Position */
#define AFEC_CECR_ECORR7_Msk                (_U_(0x1) << AFEC_CECR_ECORR7_Pos)             /**< (AFEC_CECR) Error Correction Enable for channel 7 Mask */
#define AFEC_CECR_ECORR7                    AFEC_CECR_ECORR7_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CECR_ECORR7_Msk instead */
#define AFEC_CECR_ECORR8_Pos                8                                              /**< (AFEC_CECR) Error Correction Enable for channel 8 Position */
#define AFEC_CECR_ECORR8_Msk                (_U_(0x1) << AFEC_CECR_ECORR8_Pos)             /**< (AFEC_CECR) Error Correction Enable for channel 8 Mask */
#define AFEC_CECR_ECORR8                    AFEC_CECR_ECORR8_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CECR_ECORR8_Msk instead */
#define AFEC_CECR_ECORR9_Pos                9                                              /**< (AFEC_CECR) Error Correction Enable for channel 9 Position */
#define AFEC_CECR_ECORR9_Msk                (_U_(0x1) << AFEC_CECR_ECORR9_Pos)             /**< (AFEC_CECR) Error Correction Enable for channel 9 Mask */
#define AFEC_CECR_ECORR9                    AFEC_CECR_ECORR9_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CECR_ECORR9_Msk instead */
#define AFEC_CECR_ECORR10_Pos               10                                             /**< (AFEC_CECR) Error Correction Enable for channel 10 Position */
#define AFEC_CECR_ECORR10_Msk               (_U_(0x1) << AFEC_CECR_ECORR10_Pos)            /**< (AFEC_CECR) Error Correction Enable for channel 10 Mask */
#define AFEC_CECR_ECORR10                   AFEC_CECR_ECORR10_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CECR_ECORR10_Msk instead */
#define AFEC_CECR_ECORR11_Pos               11                                             /**< (AFEC_CECR) Error Correction Enable for channel 11 Position */
#define AFEC_CECR_ECORR11_Msk               (_U_(0x1) << AFEC_CECR_ECORR11_Pos)            /**< (AFEC_CECR) Error Correction Enable for channel 11 Mask */
#define AFEC_CECR_ECORR11                   AFEC_CECR_ECORR11_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_CECR_ECORR11_Msk instead */
#define AFEC_CECR_MASK                      _U_(0xFFF)                                     /**< \deprecated (AFEC_CECR) Register MASK  (Use AFEC_CECR_Msk instead)  */
#define AFEC_CECR_Msk                       _U_(0xFFF)                                     /**< (AFEC_CECR) Register Mask  */

